; domain
;domain file for the problem 3.1 of the assigment
;definition of the the injured people scenario

; ---------------------------------------------------

(define (domain injured-people-scenario)

(:requirements  :strips :typing :negative-preconditions :equality :disjunctive-preconditions) 

(:types 

    location - object
    robot - object
    person - object
    crate - object
    medicine food - crate ;crate content modelled in a generic way -> "expand" type crate as medicine or food (easier to add new kind of crate)
    
)

(:constants 
    agent - robot
    depot - location ; since it appears in all problem instances may also be considered as a const
)

(:predicates 

    ;(at ?obj - object ?l - location) ; generic

    ; localization of robots, people and crates (redundant but more intuitive)
    (robot_at ?r - robot ?l - location)
    (person_at ?p - person ?l - location)
    (crate_at ?c - crate ?l - location)

    (has_crate ?p - person ?c - crate) ; the person has a certain crate (medicine and/or food)
    (carrying ?r - robot ?c - crate) ; robot is carrying a certain  crate

    (free ?r - robot) ; the robot is not carrying any crate
)

; actions

; pick up a single crate and load it on the robotic agent, if it is at the same location as the crate
(:action load
    :parameters (?r - robot ?c - crate ?l - location)
    :precondition (and (crate_at ?c ?l) (robot_at ?r ?l) (not (carrying ?r ?c)) (free ?r)) 
    ; crate and robot must be at the same loc and robot must not be already carrying a crate
    ; since it can only pick up a single crate
    :effect (and (carrying ?r ?c) (not (free ?r)) (not (crate_at ?c ?l)))
)

; deliver a crate to a specific person who is at the same location
(:action unload
    :parameters (?r - robot ?c - crate ?p - person ?l - location)
    :precondition (and (carrying ?r ?c) (robot_at ?r ?l) (person_at ?p ?l)) ; r and p must be at the same location
    :effect (and (free ?r) (has_crate ?p ?c) (not (carrying ?r ?c)) ) ; resutl: p has c and r is now free (no more holding c)
)

;move to another location moving the loaded crate;
(:action move
    :parameters (?r - robot ?src ?dst - location)
    :precondition (and (robot_at ?r ?src) (not (= ?src ?dst))) ; src!= dst to actually move
    :effect (and (not (robot_at ?r ?src)) (robot_at ?r ?dst))
)

)

; problem
(define (problem problem_one) (:domain injured-people-scenario)
(:objects 
    
    l1 l2 l3 l4 - location
    alice bob mary dave - person

    f0 f1 f2 f3 - food
    m0 m1 m2 m3 - medicine
)

(:init
    
    (person_at alice l1)
    (person_at bob l2)
    (person_at mary l2)
    (person_at dave l4)

    (crate_at f0 depot) (crate_at f1 depot) (crate_at f2 depot)
    (crate_at m0 depot) (crate_at m1 depot) (crate_at m2 depot)

    (robot_at agent depot)

    (free agent) ; needed otherwise agent cannot load crates (closed world assumption)
)

(:goal (and

    ;Alice wants only food
    (or (has_crate alice f0) (has_crate alice f1) (has_crate alice f2))

    ; bob wants only medicine
    (or (has_crate bob m0) (has_crate bob m1) (has_crate bob m2))

    ; mary wants food and medicine
    (or (has_crate mary f0) (has_crate mary f1) (has_crate mary f2))
    (or (has_crate mary m0) (has_crate mary m1) (has_crate mary m2))

    ; dave doesn't want neither food or medicine
    (not (or (has_crate dave f0) (has_crate dave f1) (has_crate dave f2)))
    (not (or (has_crate dave m0) (has_crate dave m1) (has_crate dave m2)))

    ;; ------------------------------------------------------------------------
    ;; additional goal: make agent return to depot to be ready for new delivery
    (robot_at agent depot)

    ;; ------------------------------------------------------------------------

    ;; alternative solution using existential quantifiers

    ;; Alice only needs food
    ;(exists (?cf - food) (has_crate alice ?cf)) 

    ;; bob only needs medicine
    ;(exists (?cm - medicine) (has_crate bob ?cm))

    ;; mary needs both food and medicine
    ;(exists (?cf - food) (has_crate mary ?cf))
    ;(exists (?cm - medicine) (has_crate mary ?cm))
    
    ;; dave doesn't need food or medicine
    ;(not (exists (?cf - food) (has_crate dave ?cf)))
    ;(not (exists (?cm - medicine) (has_crate dave ?cm)))
)
)

)

; plan
1. (load agent f1 depot)
   deleted: (free agent) (crate_at f1 depot)
   added: (carrying agent f1)
   goals met: 3 of 7
2. (move agent depot l1)
   deleted: (robot_at agent depot)
   added: (robot_at agent l1)
   goals met: 2 of 7
3. (unload agent f1 alice l1)
   deleted: (carrying agent f1)
   added: (free agent) (has_crate alice f1)
   goals met: 3 of 7
4. (move agent l1 depot)
   deleted: (robot_at agent l1)
   added: (robot_at agent depot)
   goals met: 4 of 7
5. (load agent f2 depot)
   deleted: (free agent) (crate_at f2 depot)
   added: (carrying agent f2)
   goals met: 4 of 7
6. (move agent depot l2)
   deleted: (robot_at agent depot)
   added: (robot_at agent l2)
   goals met: 3 of 7
7. (unload agent f2 mary l2)
   deleted: (carrying agent f2)
   added: (free agent) (has_crate mary f2)
   goals met: 4 of 7
8. (move agent l2 depot)
   deleted: (robot_at agent l2)
   added: (robot_at agent depot)
   goals met: 5 of 7
9. (load agent m0 depot)
   deleted: (free agent) (crate_at m0 depot)
   added: (carrying agent m0)
   goals met: 5 of 7
10. (move agent depot l2)
   deleted: (robot_at agent depot)
   added: (robot_at agent l2)
   goals met: 4 of 7
11. (unload agent m0 bob l2)
   deleted: (carrying agent m0)
   added: (free agent) (has_crate bob m0)
   goals met: 5 of 7
12. (move agent l2 depot)
   deleted: (robot_at agent l2)
   added: (robot_at agent depot)
   goals met: 6 of 7
13. (load agent m1 depot)
   deleted: (free agent) (crate_at m1 depot)
   added: (carrying agent m1)
   goals met: 6 of 7
14. (move agent depot l2)
   deleted: (robot_at agent depot)
   added: (robot_at agent l2)
   goals met: 5 of 7
15. (unload agent m1 mary l2)
   deleted: (carrying agent m1)
   added: (free agent) (has_crate mary m1)
   goals met: 6 of 7
16. (move agent l2 depot)
   deleted: (robot_at agent l2)
   added: (robot_at agent depot)
   goals met: 7 of 7
